[[["85146270-53c6-4c30-ad02-728c3a323aa8",{"pageContent":"Bulbasaur (Japanese: フシギダネ, Fushigidane) is a dual-type Grass/Poison Seed Pokémon and is the very first in the National Dex (#001). Standing at 0.7 meters and weighing 6.9 kg, Bulbasaur is known for being the only starter with dual types in its base form. It evolves into Ivysaur and later into Venusaur. Bulbasaur's abilities include Overgrow, with Chlorophyll as its hidden ability. It debuted as a starter in Pokémon Red, Blue, and Green. In","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":1,"to":1}}}}],["b0f1859a-f9e9-42b5-8752-441c81a061cf",{"pageContent":"base form. It evolves into Ivysaur and later into Venusaur. Bulbasaur's abilities include Overgrow, with Chlorophyll as its hidden ability. It debuted as a starter in Pokémon Red, Blue, and Green. In battles, Bulbasaur can learn moves like Leech Seed and Sleep Powder, making it a solid tactical choice. In competitive Little Cup play, it becomes surprisingly tanky with an Eviolite, using Sleep Powder, Leech Seed, and Sludge Bomb to great effect.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":1,"to":1}}}}],["a871d86b-596c-421e-a0b9-5ccde53a8f59",{"pageContent":"Ivysaur (Japanese: フシギソウ, Fushigisou) evolves from Bulbasaur and continues the Grass/Poison typing. Registered as #002 in the National Dex, Ivysaur stands at 1.0 meter and weighs 13.0 kg. Its distinctive flower bud on its back grows larger with more sunlight exposure. Ivysaur shares the same abilities as Bulbasaur—Overgrow and Chlorophyll (hidden). In lower-tier competitive formats, Ivysaur performs well with Eviolite, utilizing Giga Drain and","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":3,"to":3}}}}],["7b211332-27c8-4c01-8a8a-3541a47a5ed5",{"pageContent":"sunlight exposure. Ivysaur shares the same abilities as Bulbasaur—Overgrow and Chlorophyll (hidden). In lower-tier competitive formats, Ivysaur performs well with Eviolite, utilizing Giga Drain and Knock Off for both bulk and utility.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":3,"to":3}}}}],["ae4c4a9e-2518-4763-a543-3a270e1f018b",{"pageContent":"Venusaur (Japanese: フシギバナ, Fushigibana), the final evolution of Bulbasaur, is a Grass/Poison Pokémon listed as #003. It grows to 2.0 meters in height and weighs 100.0 kg. Venusaur has a Mega Evolution and can also Gigantamax in Sword and Shield. Its abilities include Overgrow, with Thick Fat as a Mega ability, giving it resistance to Fire and Ice attacks. Venusaur is often depicted absorbing sunlight through the large flower on its back.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":5,"to":5}}}}],["b36a2c0f-5843-4885-9cb0-c5a0531f5c93",{"pageContent":"Its abilities include Overgrow, with Thick Fat as a Mega ability, giving it resistance to Fire and Ice attacks. Venusaur is often depicted absorbing sunlight through the large flower on its back. Competitively, Mega Venusaur thrives in the OU tier, especially with a moveset like Giga Drain, Sludge Bomb, Synthesis, and Leech Seed, making it both durable and threatening.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":5,"to":5}}}}],["67962318-80fd-4572-a1f3-000a531c8bde",{"pageContent":"Charmander (Japanese: ヒトカゲ, Hitokage) is a Fire-type Lizard Pokémon and appears as #004 in the National Dex. It stands at 0.6 meters and weighs 8.5 kg. Known for the flame on its tail that reflects its emotional state, Charmander evolves into Charmeleon and then Charizard. Its abilities include Blaze and Solar Power as its hidden ability. In competitive Little Cup battles, Charmander can deal significant damage under sunlight using Solar Power","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":7,"to":7}}}}],["3f0ec763-6837-4b5d-a668-6d6f4d0d6872",{"pageContent":"and then Charizard. Its abilities include Blaze and Solar Power as its hidden ability. In competitive Little Cup battles, Charmander can deal significant damage under sunlight using Solar Power and Fire Blast.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":7,"to":7}}}}],["e086599f-c906-4fed-b52d-e51ca87aa610",{"pageContent":"Charmeleon (Japanese: リザード, Lizardo) is the evolved form of Charmander and maintains the Fire typing. Listed as #005 in the National Dex, Charmeleon is 1.1 meters tall and weighs 19.0 kg. It has a fierce personality and is known for its aggressive nature in battle. With Blaze and Solar Power abilities, it can serve as a special attacker in mid-tier formats. Equipping Eviolite enhances its survivability, and it can use moves like Fire Blast,","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":9,"to":9}}}}],["a77c4503-b585-4365-a209-45c7da2b317b",{"pageContent":"nature in battle. With Blaze and Solar Power abilities, it can serve as a special attacker in mid-tier formats. Equipping Eviolite enhances its survivability, and it can use moves like Fire Blast, Dragon Pulse, and Sunny Day for offensive setups.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":9,"to":9}}}}],["df5d3018-cb65-40a1-bb3c-df9e1511cffc",{"pageContent":"Charizard (Japanese: リザードン, Lizardon), the final evolution of Charmander, is a Fire/Flying-type Pokémon. It’s #006 in the National Dex, with a height of 1.7 meters and weight of 90.5 kg. Charizard has both Mega Evolutions (X and Y) and a Gigantamax form. Its abilities vary: Blaze is standard, Tough Claws for Mega X, and Drought for Mega Y. Notably, Mega Charizard X gains the Dragon typing. It’s extremely popular in the anime and merchandise.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":11,"to":11}}}}],["00cfc2a0-30ed-41fa-a7a4-d80e0b72ef19",{"pageContent":"form. Its abilities vary: Blaze is standard, Tough Claws for Mega X, and Drought for Mega Y. Notably, Mega Charizard X gains the Dragon typing. It’s extremely popular in the anime and merchandise. Competitively, Mega Charizard Y is a great sun team leader using Drought, Fire Blast, and Solar Beam. Mega Charizard X focuses on physical offense with Dragon Dance, Flare Blitz, and Dragon Claw. The Gigantamax form excels in Dynamax formats with G-Max","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":11,"to":11}}}}],["3979073c-2b18-4540-9d81-cdccf8715d4e",{"pageContent":"using Drought, Fire Blast, and Solar Beam. Mega Charizard X focuses on physical offense with Dragon Dance, Flare Blitz, and Dragon Claw. The Gigantamax form excels in Dynamax formats with G-Max Wildfire.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":11,"to":11}}}}],["13875a25-f801-4961-a4e1-dd47e4f7e4c2",{"pageContent":"Squirtle (Japanese: ゼニガメ, Zenigame) is a Water-type Tiny Turtle Pokémon and starts the Squirtle evolution line. It is #007 in the National Dex, stands 0.5 meters tall, and weighs 9.0 kg. With Torrent and Rain Dish (hidden ability), Squirtle can become quite the threat in Little Cup battles. In the anime, it famously led the 'Squirtle Squad'. Competitively, its Shell Smash set is dangerous, allowing powerful moves like Hydro Pump and Ice Beam to","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":13,"to":13}}}}],["6cf58a27-4e0c-4e79-8630-e5f4fc1d163b",{"pageContent":"quite the threat in Little Cup battles. In the anime, it famously led the 'Squirtle Squad'. Competitively, its Shell Smash set is dangerous, allowing powerful moves like Hydro Pump and Ice Beam to shine.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":13,"to":13}}}}],["04ef113b-cf03-4ce0-832a-2917415e3e5a",{"pageContent":"Wartortle (Japanese: カメール, Kameil) evolves from Squirtle and is also a Water-type Pokémon. Number #008 in the National Dex, it grows to 1.0 meter and weighs 22.5 kg. Its fluffy tail is a symbol of age and wisdom. It shares Torrent and Rain Dish as abilities. In competitive play, Wartortle is valued as a defensive support with Eviolite, using Rapid Spin, Scald, and Haze to maintain control on the field.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":15,"to":15}}}}],["9ead0585-17a4-4926-9734-be18b968ecca",{"pageContent":"Blastoise (Japanese: カメックス, Kamex) is the final evolution of Squirtle and a pure Water-type Pokémon. At 1.6 meters tall and weighing 85.5 kg, it is #009 in the National Dex. Blastoise has both a Mega Evolution and a Gigantamax form. Its abilities include Torrent and Mega Launcher (Mega). Known for the powerful water cannons on its back, Blastoise becomes a formidable attacker in its Mega form. It benefits from Mega Launcher, boosting moves like","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":17,"to":17}}}}],["e64c82f1-67b1-48f1-a667-8ebe3b25d73e",{"pageContent":"Torrent and Mega Launcher (Mega). Known for the powerful water cannons on its back, Blastoise becomes a formidable attacker in its Mega form. It benefits from Mega Launcher, boosting moves like Aura Sphere, Dark Pulse, and Water Pulse, and it serves as an excellent Rapid Spinner in the OU tier.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":17,"to":17}}}}],["4bfa02e6-8262-491f-9f98-0f7d504bc3b1",{"pageContent":"Caterpie (Japanese: キャタピー, Caterpie) is a Bug-type Worm Pokémon and is #010 in the National Dex. Standing at 0.3 meters and weighing 2.9 kg, Caterpie is known for its voracious appetite and rapid evolution. Its ability is Shield Dust, with Run Away as a hidden ability. Caterpie evolves quickly into Metapod and then Butterfree. While not used competitively, it can use String Shot and Tackle in early battles, and is notable for its role as an","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":19,"to":19}}}}],["b89958cc-e147-4318-b67e-4de4d98e7942",{"pageContent":"as a hidden ability. Caterpie evolves quickly into Metapod and then Butterfree. While not used competitively, it can use String Shot and Tackle in early battles, and is notable for its role as an early-game encounter in the Viridian Forest.","metadata":{"source":"./public/text.txt","loc":{"lines":{"from":19,"to":19}}}}]],{"0":"85146270-53c6-4c30-ad02-728c3a323aa8","1":"b0f1859a-f9e9-42b5-8752-441c81a061cf","2":"a871d86b-596c-421e-a0b9-5ccde53a8f59","3":"7b211332-27c8-4c01-8a8a-3541a47a5ed5","4":"ae4c4a9e-2518-4763-a543-3a270e1f018b","5":"b36a2c0f-5843-4885-9cb0-c5a0531f5c93","6":"67962318-80fd-4572-a1f3-000a531c8bde","7":"3f0ec763-6837-4b5d-a668-6d6f4d0d6872","8":"e086599f-c906-4fed-b52d-e51ca87aa610","9":"a77c4503-b585-4365-a209-45c7da2b317b","10":"df5d3018-cb65-40a1-bb3c-df9e1511cffc","11":"00cfc2a0-30ed-41fa-a7a4-d80e0b72ef19","12":"3979073c-2b18-4540-9d81-cdccf8715d4e","13":"13875a25-f801-4961-a4e1-dd47e4f7e4c2","14":"6cf58a27-4e0c-4e79-8630-e5f4fc1d163b","15":"04ef113b-cf03-4ce0-832a-2917415e3e5a","16":"9ead0585-17a4-4926-9734-be18b968ecca","17":"e64c82f1-67b1-48f1-a667-8ebe3b25d73e","18":"4bfa02e6-8262-491f-9f98-0f7d504bc3b1","19":"b89958cc-e147-4318-b67e-4de4d98e7942"}]